# E. Reshaping DataFrames

While working on pandas DataFrame, there are times you have to reshape it by joining it with another DataFrame or summarizing it. In this section, we will be looking at some useful pandas methods used for reshaping DataFrames.

### _Objective_
1. **Joining DataFrames**: Understanding how to join multiple 2-dimensional datasets.
3. **Summarizing a DataFrame** : Understanding how to summarize data by `.groupby()` and `.pivot_table()`.

In [1]:
import pandas as pd
import numpy as np

<br><br>

# \[1. Joining DataFrames\]

Joining or merging DataFrames is one of the core data processing processes you need to deal with for data analysis and machine learning tasks. Pandas provides various tools for combining multiple Series or DataFrame objects along a specific axis.

Pandas provides two methods for combining two datasets(or DataFrames), which are `.merge()` and `.concat()`.

+ `.merge()` : merges DataFrames with database-style join such as inner join, outer join, left join, right join.

+ `.concat()` : concatenates two or more DataFrames/Series objects over a specified axis.

As a Python beginner, data merge or data concatenation may sound very vague. So, let's take a look at each of these in more detail with some intuitive examples.

### Example Data) Book Database

We'll be creating two datasets for a book database, one on authors and the other on readers. Then, let's see how the datasets can be joined together.

#### Dataset on authors and books

In [2]:
authors = [
    ["Yuval Noah Harari","Sapiens"],
    ["Yuval Noah Harari","Homo Deus"],
    ["Yuval Noah Harari","Money: Vintage Minis"],
    ["Bernard Werber","The Ants trilogy"],
    ["Bernard Werber","Angels cycle"],
    ["Bernard Werber","Le Jour des fourmis"],
    ["Bernard Werber","Demain les Chats"]
]
author_df = pd.DataFrame(authors,columns=["author",'book'])
display(author_df)

              author                  book
0  Yuval Noah Harari               Sapiens
1  Yuval Noah Harari             Homo Deus
2  Yuval Noah Harari  Money: Vintage Minis
3     Bernard Werber      The Ants trilogy
4     Bernard Werber          Angels cycle
5     Bernard Werber   Le Jour des fourmis
6     Bernard Werber      Demain les Chats

#### Dataset on readers and books

In [3]:
readers = [
    ["John","Demain les Chats"],
    ["John","Rebecca"],
    ["John","The Ants trilogy"],
    ["Kate","Homo Deus"],
    ["Sarah","Homo Deus"],
    ["Sarah","Sapiens"],
    ["James","Le Jour des fourmis"],
    ["James","The Ants trilogy"],
    ["Elise","Rebecca"],
    ["Elise","Sapiens"],
]

reader_df = pd.DataFrame(readers,columns=["reader",'book'])

<br>

## 1. **`.Merge()`**

+ `.merge()` is one of the pandas data combination tools that joins two or more DataFrames into a single DataFrame based on common columns or indices

+ There are different types of merges available in pandas depending on how you want the data to be merged, and you can set the type to `how` keyword.

 - **left** - uses only keys from left frame, similar to a SQL left outer join; preserves key order.

 - **right** - uses only keys from right frame, similar to a SQL right outer join; preserves key order.

 - **outer** - uses union of keys from both frames, similar to a SQL full outer join; sorts keys lexicographically.

 - **inner** - uses intersection of keys from both frames, similar to a SQL inner join; preserves the order of the left keys.

 - ![](https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2017/03/join-types-merge-names.jpg)

### (1) Inner merge

Inner merge refers to merging only the common values existing in both the left and right DataFrames.
Despite “inner” merge is the default merge type, it can explicitly be specified by passing  "`how = inner`" to `.merge()`. If you want to merge datasets based on specific columns or rows, pass the corresponding column/row names to `on` keyword.<br>
Note that the column/row name to be passed to `on` must be found in both DataFrames.

In [4]:
pd.merge(left = author_df, right = reader_df, on="book", how='inner')

              author                 book reader
0  Yuval Noah Harari              Sapiens  Sarah
1  Yuval Noah Harari              Sapiens  Elise
2  Yuval Noah Harari            Homo Deus   Kate
3  Yuval Noah Harari            Homo Deus  Sarah
4     Bernard Werber     The Ants trilogy   John
5     Bernard Werber     The Ants trilogy  James
6     Bernard Werber  Le Jour des fourmis  James
7     Bernard Werber     Demain les Chats   John

### (2) Outer merge

Outer merge refers to merging two datasets regardless of the presence of common variables. In an outer merge, all rows and columns from both datasets are retained, and in case there is no matching variable, the variable will be filled with `NaN` values.

In [5]:
df = pd.merge(author_df, reader_df, on = "book",how = 'outer')
df

               author                  book reader
0   Yuval Noah Harari               Sapiens  Sarah
1   Yuval Noah Harari               Sapiens  Elise
2   Yuval Noah Harari             Homo Deus   Kate
3   Yuval Noah Harari             Homo Deus  Sarah
4   Yuval Noah Harari  Money: Vintage Minis    NaN
5      Bernard Werber      The Ants trilogy   John
6      Bernard Werber      The Ants trilogy  James
7      Bernard Werber          Angels cycle    NaN
8      Bernard Werber   Le Jour des fourmis  James
9      Bernard Werber      Demain les Chats   John
10                NaN               Rebecca   John
11                NaN               Rebecca  Elise

In the above DataFrame, `NaN` stands for "Not a Number" meaning 'a missing value'. If you want to remove rows and columns with NaN values, use `.dropna()`.

In [6]:
# Removing rows with missing values
df.dropna()

              author                 book reader
0  Yuval Noah Harari              Sapiens  Sarah
1  Yuval Noah Harari              Sapiens  Elise
2  Yuval Noah Harari            Homo Deus   Kate
3  Yuval Noah Harari            Homo Deus  Sarah
5     Bernard Werber     The Ants trilogy   John
6     Bernard Werber     The Ants trilogy  James
8     Bernard Werber  Le Jour des fourmis  James
9     Bernard Werber     Demain les Chats   John

Alternatively, you can replace NA/NaN values with another value with <code>.fillna()</code>.

In [7]:
# Replacing `NaN` with blanks
df.fillna(value="")

               author                  book reader
0   Yuval Noah Harari               Sapiens  Sarah
1   Yuval Noah Harari               Sapiens  Elise
2   Yuval Noah Harari             Homo Deus   Kate
3   Yuval Noah Harari             Homo Deus  Sarah
4   Yuval Noah Harari  Money: Vintage Minis
5      Bernard Werber      The Ants trilogy   John
6      Bernard Werber      The Ants trilogy  James
7      Bernard Werber          Angels cycle
8      Bernard Werber   Le Jour des fourmis  James
9      Bernard Werber      Demain les Chats   John
10                                  Rebecca   John
11                                  Rebecca  Elise

### (3) Left merge

**Left merge** keeps all rows and columns of the left DataFrame. The merged dataset contains all from the left dataset and only those from the right dataset that have a matching value in the common column with the left dataset. Elements without any matching values will be filled with `NaN` values.

In the example below, information on readers of `Money: Vintage Minis` and `Angels cycle` is missing in reader_df and hence filled with `NaN`.

In [8]:
pd.merge(author_df, reader_df, how='left')

              author                  book reader
0  Yuval Noah Harari               Sapiens  Sarah
1  Yuval Noah Harari               Sapiens  Elise
2  Yuval Noah Harari             Homo Deus   Kate
3  Yuval Noah Harari             Homo Deus  Sarah
4  Yuval Noah Harari  Money: Vintage Minis    NaN
5     Bernard Werber      The Ants trilogy   John
6     Bernard Werber      The Ants trilogy  James
7     Bernard Werber          Angels cycle    NaN
8     Bernard Werber   Le Jour des fourmis  James
9     Bernard Werber      Demain les Chats   John

### (4) Right merge

**`Right join`** is the opposite of left join. It means the two DataFrames are merged based on the right dataset keeping every row from it, with `NaNs` where there are no matching join variables from the left DataFrame.

The information on the author of "Rebecca" is not present in the left DataFrame and is thus filled with `NaN`.

In [9]:
pd.merge(author_df, reader_df, how='right')

              author                 book reader
0     Bernard Werber     Demain les Chats   John
1                NaN              Rebecca   John
2                NaN              Rebecca  Elise
3     Bernard Werber     The Ants trilogy   John
4     Bernard Werber     The Ants trilogy  James
5  Yuval Noah Harari            Homo Deus   Kate
6  Yuval Noah Harari            Homo Deus  Sarah
7  Yuval Noah Harari              Sapiens  Sarah
8  Yuval Noah Harari              Sapiens  Elise
9     Bernard Werber  Le Jour des fourmis  James

## 2. Concat

`.concat()` allows you to stack a DataFrame to other existing DataFrames in a specific direction, either downwards or sideways.

### (1) Concatenating DataFrames along rows - `axis = 0`

In [10]:
df1 = pd.DataFrame([81,82,83,80],columns=["score"])
df2 = pd.DataFrame([90,91,80,75],columns=["score"])
result_df = pd.concat([df1,df2],axis=0)

Let's look at the index values of the concatenated DataFrame

In [11]:
result_df

   score
0     81
1     82
2     83
3     80
0     90
1     91
2     80
3     75

Since the new DataFrame has duplicated index values, you can reset them with `reset_index()`.

In [12]:
result_df.reset_index(drop=True, inplace=True)

By passing `inplace = True`, you can modify an existing DataFrame with the desired operation and does it `in place`, that is on the original data frame.

In [13]:
result_df

   score
0     81
1     82
2     83
3     80
4     90
5     91
6     80
7     75

### (2) Concatenating DataFrames along columns - `axis = 1`

In [14]:
df1 = pd.DataFrame([81,82,83,80],columns=["english_score"])
df2 = pd.DataFrame([90,91,80,75],columns=["math_score"])
pd.concat([df1,df2],axis=1)

   english_score  math_score
0             81          90
1             82          91
2             83          80
3             80          75

Although the columns to be concatenated are of the same name, they are not joined downwards. Instead, with `axis=1`, the concatenation is performed sideways.

In [15]:
df1 = pd.DataFrame([81,82,83,80],columns=["score"])
df2 = pd.DataFrame([90,91,80,75],columns=["score"])
pd.concat([df1,df2],axis=1)

   score  score
0     81     90
1     82     91
2     83     80
3     80     75

<br><br>

# \[2. Summarizing DataFrames\]

There are two well-known pandas methods for summarising DataFrames. 

1. `.groupby()`to group DataFrame using a mapper or by a Series of columns.

2. `.pivot_table()` to group DataFrame by multilevel index in a spreadsheet-style pivot table.

####  Example Data) Student report cards

In [16]:
columns = ["class","l_name", "f_name", "history", "english", "math", "social_studies", "science"]
scores = [["1", "Smith", "John", 80, 92, 70, 65, 92],
          ["1", "Schafer", "Elise", 91, 75, 90, 68, 85],
          ["2", "Zimmermann", "Kate", 86, 76, 42, 72, 88],
          ["2", "Mendoza", "James", 77, 92, 52, 60, 80],
          ["3", "Park", "Jay", 75, 85, 85, 92, 95],
          ["3", "Delcourt", "Emma", 96, 90, 95, 81, 72],
          ["4", "Thompson", "Sarah", 91, 81, 92, 81, 73]]
df = pd.DataFrame(scores,columns=columns)
df

  class      l_name f_name  history  english  math  social_studies  science
0     1       Smith   John       80       92    70              65       92
1     1     Schafer  Elise       91       75    90              68       85
2     2  Zimmermann   Kate       86       76    42              72       88
3     2     Mendoza  James       77       92    52              60       80
4     3        Park    Jay       75       85    85              92       95
5     3    Delcourt   Emma       96       90    95              81       72
6     4    Thompson  Sarah       91       81    92              81       73


## 1. `.groupby()`
`.groupby()` splits data into groups based on certain criteria and returns a groupby object that contains the grouped data. <br>
GroupBy objects can be returned by groupby calls.

### (1) Calling groupby objects

Let's create a `groupby` object by grouping the example data on `class`.

In [17]:
df.groupby(['class'])

`.groupby()` on a DataFrame returns a `DataFrameGroupBy` object. The `DataFrameGroupBy` object can be called by a `for` loop.

In [18]:
for class_name, class_df in df.groupby(['class']):
    print("class number : ",class_name)
    display(class_df)
    print('----\n')

class number :  1

  class   l_name f_name  history  english  math  social_studies  science
0     1    Smith   John       80       92    70              65       92
1     1  Schafer  Elise       91       75    90              68       85

----

class number :  2

  class      l_name f_name  history  english  math  social_studies  science
2     2  Zimmermann   Kate       86       76    42              72       88
3     2     Mendoza  James       77       92    52              60       80

----

class number :  3

  class    l_name f_name  history  english  math  social_studies  science
4     3      Park    Jay       75       85    85              92       95
5     3  Delcourt   Emma       96       90    95              81       72

----

class number :  4

  class    l_name f_name  history  english  math  social_studies  science
6     4  Thompson  Sarah       91       81    92              81       73

----

### (2) Aggregate operation on groupby objects

`.groupby()` supports a variety of methods for aggregate operations. If you want to calculate the average score in each subject by class, apply `.mean()` to the groupby object.

In [19]:
# The average score in each subject by class
df.groupby("class").mean()

       history  english  math  social_studies  science
class
1         85.5     83.5  80.0            66.5     88.5
2         81.5     84.0  47.0            66.0     84.0
3         85.5     87.5  90.0            86.5     83.5
4         91.0     81.0  92.0            81.0     73.0

In [20]:
# Average score in History by class 
df.groupby("class")["history"].mean()

class
1    85.5
2    81.5
3    85.5
4    91.0
Name: history, dtype: float64

The following methods are supported on groupby objects.

| Method Name | Description |
| ----  | ---- |
| .count | Number of records in the group |
| .mean  | Average value in the group |
| .min   | Minimum value in the group|
| .max   | Maximum value in the group|
| .quantile | Quartile in the group |
| .sum   | Sum of the group data |
| .std   | Standard deviation of the group data |


## 2. `.pivot_table()`


+ Pivot table is one of the most powerful and useful tools in data analytics for data summarization.

In [21]:
# Let's find out the average score in History by gender for each class
df["gender"] = ["Male","Female","Female","Male","Male","Female","Female"]
df

,class,l_name,f_name,history,english,math,social_studies,science,gender
0,1,Smith,John,80,92,70,65,92,Male
1,1,Schafer,Elise,91,75,90,68,85,Female
2,2,Zimmermann,Kate,86,76,42,72,88,Female
3,2,Mendoza,James,77,92,52,60,80,Male
4,3,Park,Jay,75,85,85,92,95,Male
5,3,Delcourt,Emma,96,90,95,81,72,Female
6,4,Thompson,Sarah,91,81,92,81,73,Female

### (1) Creating a pivot table


When creating a pivot table, it is important to know which column values are to be used as the row and column index.

For instance, if you want to see the average score of each class on the history by gender, set `value`, `index`, `columns`, `aggfunc` as follows.

In [22]:
df.pivot_table(index=["class"], columns=["gender"], values=["history"], aggfunc = 'mean')

       history
gender  Female  Male
class
1         91.0  80.0
2         86.0  77.0
3         96.0  75.0
4         91.0   NaN

### (2) Aggfunc in pivot-table

By default, `aggfunc` is set to `mean`. When using other aggregate operations, pass other keywords such as `sum`, `count`, `unique`, etc.

In [23]:
df.pivot_table(index=["class"],
               columns=["gender"],
               values=["history"],
               aggfunc="count")

       history
gender  Female Male
class
1          1.0  1.0
2          1.0  1.0
3          1.0  1.0
4          1.0  NaN

### (3) Creating a pivot table in multilevel index

If you want to summarize data based on values of multiple columns, you can simply pass a list of columns of interest to the `values` parameter. It will then return a pivot table in multilevel index.

In [24]:
df.pivot_table(values=["history", "english", "math"],
               index=["class"],
               columns=["gender"],
               aggfunc="count")

       english      history        math
gender  Female Male  Female Male Female Male
class
1          1.0  1.0     1.0  1.0    1.0  1.0
2          1.0  1.0     1.0  1.0    1.0  1.0
3          1.0  1.0     1.0  1.0    1.0  1.0
4          1.0  NaN     1.0  NaN    1.0  NaN